      E1:     C1 CALL pred explicit_subtree.main/2-0 (det) explicit_subtree.m:15
mdb> mdb> Contexts will not be printed.
mdb> echo on
Command echo enabled.
mdb> untrust 0
mdb> table_io allow
mdb> table_io start
I/O tabling started.
mdb> break divide2
 0: + stop  interface pred explicit_subtree.divide2/3-0 (det)
mdb> continue
      E2:     C2 CALL pred explicit_subtree.divide2/3-0 (det)
mdb> finish
      E3:     C2 EXCP pred explicit_subtree.divide2/3-0 (det) t;c3;
mdb> dd -ad3
Call divide2(10, 0, _)
Throws "zero denominator"
Expected? browse 2
browser> mark
-(100, 100) = 0
Valid? n
Found incorrect contour:
-(100, 100) = 0
Is this a bug? n
-(100, 100) = 0
Valid? [no] y
Call calc(10, _)
Throws "zero denominator"
Expected? n
>(10, 0)
Valid? y
a(0)
Valid? n
q(49, 0, 49)
Valid? y
q(51, 0, 51)
Valid? b 3
browser> mark
+(50, 1) = 51
Valid? n
Found incorrect contour:
+(50, 1) = 51
Is this a bug? n
+(50, 1) = 51
Valid? [no] y
Call =<(51, 0)
No solutions.
Complete? y
-(51, 1) = 50
Valid? y
+(0, 1) = 1
Valid? y
q(50, 1, 51)
Valid? y
Found incorrect contour:
q(51, 0, 51)
Is this a bug? n
q(51, 0, 51)
Valid? y
+(49, 51) = 100
Valid? y
Found incorrect contour:
a(0)
Is this a bug? n
a(0)
Valid? [no] n
q(49, 0, 49)
Valid? [yes] b 3
browser> mark
+(48, 1) = 49
Valid? n
Found incorrect contour:
+(48, 1) = 49
Is this a bug? n
+(48, 1) = 49
Valid? [no] y
Call =<(49, 0)
No solutions.
Complete? y
-(49, 1) = 48
Valid? y
+(0, 1) = 1
Valid? [yes] y
q(48, 1, 49)
Valid? y
Found incorrect contour:
q(49, 0, 49)
Is this a bug? n
q(49, 0, 49)
Valid? y
q(51, 0, 51)
Valid? [yes] y
+(49, 51) = 100
Valid? [yes] y
-(100, 100) = 0
Valid? [yes] y
Found incorrect contour:
a(0)
Is this a bug? n
a(0)
Valid? [no] y
Call divide2(10, 0, _)
Throws "zero denominator"
Expected? y
Found unhandled exception:
calc(10, _)
"zero denominator"
Is this a bug? n
Call calc(10, _)
Throws "zero denominator"
Expected? [no] y
Call p3(10, _)
Throws "zero denominator"
Expected? y
Call p2(10, _)
Throws "zero denominator"
Expected? y
Call p1(10, _)
Throws "zero denominator"
Expected? y
Call main(_, _)
Throws "zero denominator"
Expected? y
No bug found.
      E3:     C2 EXCP pred explicit_subtree.divide2/3-0 (det) t;c3;
mdb> quit -y
