       1:      1  1 CALL pred ho4.main/2-0 (det) ho4.m:8
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> break p
 0: + stop  interface pred ho4.p/1-0 (semidet)
mdb> continue
       3:      2  2 CALL pred ho4.p/1-0 (semidet) ho4.m:28 (ho4.m:10)
mdb> finish
      18:      2  2 FAIL pred ho4.p/1-0 (semidet) ho4.m:28 (ho4.m:10)
mdb> dd
Call p(1)
Unsatisfiable? no
q(r(5), 5)
Valid? yes
q(r(5), 0)
Valid? yes
Call q(r(5), _)
Solutions:
	q(r(5), 5)
	q(r(5), 0)
Complete? yes
Found partially uncovered atom:
p(1)
Is this a bug? yes
      18:      2  2 FAIL pred ho4.p/1-0 (semidet) ho4.m:28 (ho4.m:10)
mdb> continue
      21:      5  2 CALL pred ho4.p/1-0 (semidet) ho4.m:28 (ho4.m:17)
mdb> finish
      36:      5  2 FAIL pred ho4.p/1-0 (semidet) ho4.m:28 (ho4.m:17)
mdb> dd
Call p(2)
Unsatisfiable? no
Found partially uncovered atom:
p(2)
Is this a bug? yes
      36:      5  2 FAIL pred ho4.p/1-0 (semidet) ho4.m:28 (ho4.m:17)
mdb> continue
\+ p(1).
\+ p(2).
